results/runs/ycsb/2026-05-17T09-52-01/redis/run_workload_b.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/redis-binding/lib/commons-pool2-2.4.2.jar:/ycsb/redis-binding/lib/jedis-2.9.0.jar:/ycsb/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P workloads/workloadb -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p operationcount=100000 -p threadcount=10
Command line: -t -db site.ycsb.db.RedisClient -s -P workloads/workloadb -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p operationcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-17 09:44:45:134 0 sec: 0 operations; est completion in 0 second 
2026-05-17 09:44:50:471 5 sec: 100000 operations; 18274.85 current ops/sec; [READ: Count=94973, Max=74431, Min=63, Avg=520.53, 90=650, 99=2837, 99.9=9087, 99.99=59359] [CLEANUP: Count=10, Max=1577, Min=46, Avg=233.2, 90=142, 99=1577, 99.9=1577, 99.99=1577] [UPDATE: Count=5027, Max=35359, Min=99, Avg=564.71, 90=694, 99=3659, 99.9=11175, 99.99=17407] 
[OVERALL], RunTime(ms), 5473
[OVERALL], Throughput(ops/sec), 18271.51470856934
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 65
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.187648456057007
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 65
[TOTAL_GC_TIME_%], Time(%), 1.187648456057007
[READ], Operations, 94973
[READ], AverageLatency(us), 520.5303296726438
[READ], MinLatency(us), 63
[READ], MaxLatency(us), 74431
[READ], 95thPercentileLatency(us), 834
[READ], 99thPercentileLatency(us), 2837
[READ], Return=OK, 94973
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 233.2
[CLEANUP], MinLatency(us), 46
[CLEANUP], MaxLatency(us), 1577
[CLEANUP], 95thPercentileLatency(us), 1577
[CLEANUP], 99thPercentileLatency(us), 1577
[UPDATE], Operations, 5027
[UPDATE], AverageLatency(us), 564.7127511438233
[UPDATE], MinLatency(us), 99
[UPDATE], MaxLatency(us), 35359
[UPDATE], 95thPercentileLatency(us), 921
[UPDATE], 99thPercentileLatency(us), 3659
[UPDATE], Return=OK, 5027